benchmarks/results/nebulift-auto-instrumented-rnd-1_0-c16.txt
Running 10s test @ http://localhost:8000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.24ms  225.14us   8.55ms   88.69%
    Req/Sec     1.61k    62.39     2.51k    90.15%
  Latency Distribution
     50%    1.20ms
     75%    1.28ms
     90%    1.42ms
     99%    2.12ms
  128442 requests in 10.10s, 48.51MB read
Requests/sec:  12717.79
Transfer/sec:      4.80MB