benchmarks/results/nebulift-auto-instrumented-rnd-1_0-c8.txt
Running 10s test @ http://localhost:8000
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.90ms  155.03us   2.83ms   66.81%
    Req/Sec     1.11k    41.93     1.43k    69.61%
  Latency Distribution
     50%    0.88ms
     75%    1.00ms
     90%    1.10ms
     99%    1.32ms
  88500 requests in 10.10s, 33.42MB read
Requests/sec:   8762.52
Transfer/sec:      3.31MB