benchmarks/results/nebulift-auto-instrumented-rnd-1_10-c4.txt
Running 10s test @ http://localhost:8000
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   810.74us  137.26us   2.70ms   73.01%
    Req/Sec     1.22k    35.98     1.35k    67.99%
  Latency Distribution
     50%  789.00us
     75%    0.88ms
     90%    0.99ms
     99%    1.23ms
  49070 requests in 10.10s, 16.20MB read
  Non-2xx or 3xx responses: 13852
Requests/sec:   4858.54
Transfer/sec:      1.60MB