benchmarks/results/nebulift-auto-instrumented-rnd-1_3-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.33ms    0.91ms  10.01ms   63.82%
    Req/Sec   119.70      7.70   150.00     59.00%
  Latency Distribution
     50%    8.34ms
     75%    9.07ms
     90%    9.65ms
     99%    9.89ms
  1194 requests in 10.02s, 461.17KB read
  Non-2xx or 3xx responses: 2
Requests/sec:    119.22
Transfer/sec:     46.05KB