benchmarks/results/nebulift-auto-instrumented-rnd-1_3-c16.txt
Running 10s test @ http://localhost:8000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.31ms  204.85us   7.35ms   84.05%
    Req/Sec     1.53k    38.74     1.63k    63.62%
  Latency Distribution
     50%    1.27ms
     75%    1.38ms
     90%    1.51ms
     99%    2.05ms
  121872 requests in 10.00s, 45.71MB read
  Non-2xx or 3xx responses: 909
Requests/sec:  12182.59
Transfer/sec:      4.57MB