benchmarks/results/nebulift-auto-instrumented-rnd-1_5-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.29ms    0.90ms  10.17ms   63.80%
    Req/Sec   120.27      7.09   141.00     63.00%
  Latency Distribution
     50%    8.32ms
     75%    8.81ms
     90%    9.61ms
     99%    9.90ms
  1199 requests in 10.01s, 462.29KB read
  Non-2xx or 3xx responses: 6
Requests/sec:    119.77
Transfer/sec:     46.18KB