benchmarks/results/nebulift-auto-instrumented-rnd-1_5-c4.txt
Running 10s test @ http://localhost:8000
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   803.86us  140.78us   4.37ms   75.03%
    Req/Sec     1.23k    28.83     1.32k    70.22%
  Latency Distribution
     50%  782.00us
     75%    0.87ms
     90%    0.98ms
     99%    1.24ms
  49494 requests in 10.10s, 18.06MB read
  Non-2xx or 3xx responses: 3413
Requests/sec:   4900.32
Transfer/sec:      1.79MB