benchmarks/results/nebulift-manual-instrument-rnd-1_0-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     7.44ms  832.69us   9.27ms   75.22%
    Req/Sec   133.98      9.31   161.00     77.00%
  Latency Distribution
     50%    7.74ms
     75%    7.92ms
     90%    8.16ms
     99%    9.00ms
  1336 requests in 10.01s, 517.96KB read
Requests/sec:    133.47
Transfer/sec:     51.74KB