benchmarks/results/nebulift-manual-instrument-rnd-1_10-c4.txt
Running 10s test @ http://localhost:8000
  4 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   499.01us   94.40us   5.46ms   77.59%
    Req/Sec     1.98k    49.59     2.09k    66.83%
  Latency Distribution
     50%  479.00us
     75%  547.00us
     90%  615.00us
     99%  780.00us
  79684 requests in 10.10s, 26.31MB read
  Non-2xx or 3xx responses: 22507
Requests/sec:   7889.25
Transfer/sec:      2.60MB