benchmarks/results/nebulift-manual-instrument-rnd-1_2-c8.txt
Running 10s test @ http://localhost:8000
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   586.29us  104.78us   2.13ms   66.26%
    Req/Sec     1.70k    45.10     1.95k    73.57%
  Latency Distribution
     50%  570.00us
     75%  664.00us
     90%  720.00us
     99%    0.87ms
  136074 requests in 10.10s, 51.22MB read
  Non-2xx or 3xx responses: 38
Requests/sec:  13472.80
Transfer/sec:      5.07MB