benchmarks/results/nebulift-manual-instrument-rnd-1_3-c16.txt
Running 10s test @ http://localhost:8000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   847.10us  183.35us   5.72ms   89.82%
    Req/Sec     2.37k    43.40     2.67k    77.70%
  Latency Distribution
     50%  805.00us
     75%    0.88ms
     90%    0.99ms
     99%    1.63ms
  190023 requests in 10.10s, 71.25MB read
  Non-2xx or 3xx responses: 1545
Requests/sec:  18814.86
Transfer/sec:      7.05MB