benchmarks/results/nebulift-manual-instrument-rnd-1_5-c16.txt
Running 10s test @ http://localhost:8000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.87ms  194.78us   4.73ms   89.79%
    Req/Sec     2.29k    36.79     2.39k    66.96%
  Latency Distribution
     50%  833.00us
     75%    0.91ms
     90%    1.02ms
     99%    1.71ms
  184288 requests in 10.10s, 67.28MB read
  Non-2xx or 3xx responses: 12578
Requests/sec:  18246.99
Transfer/sec:      6.66MB