benchmarks/results/nebulift-manual-instrument-rnd-1_6-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   331.22us   71.15us   1.73ms   88.10%
    Req/Sec     2.96k   174.60     3.19k    65.35%
  Latency Distribution
     50%  310.00us
     75%  342.00us
     90%  420.00us
     99%  597.00us
  29700 requests in 10.10s, 10.63MB read
  Non-2xx or 3xx responses: 3360
Requests/sec:   2940.60
Transfer/sec:      1.05MB