benchmarks/results/nebulift-manual-instrument-rnd-1_6-c2.txt
Running 10s test @ http://localhost:8000
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   503.73us  103.12us   1.42ms   66.96%
    Req/Sec     1.97k   112.48     2.26k    73.27%
  Latency Distribution
     50%  531.00us
     75%  563.00us
     90%  601.00us
     99%  772.00us
  39610 requests in 10.10s, 14.16MB read
  Non-2xx or 3xx responses: 4536
Requests/sec:   3921.66
Transfer/sec:      1.40MB