benchmarks/results/nebulift-manual-instrument-rnd-1_6-c32.txt
Running 10s test @ http://localhost:8000
  8 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.77ms  231.02us   5.92ms   84.29%
    Req/Sec     2.27k    68.60     3.03k    98.01%
  Latency Distribution
     50%    1.74ms
     75%    1.84ms
     90%    1.98ms
     99%    2.64ms
  181804 requests in 10.10s, 65.09MB read
  Non-2xx or 3xx responses: 20283
Requests/sec:  18001.10
Transfer/sec:      6.44MB