benchmarks/results/nebulift-manual-instrument-rnd-1_6-c8.txt
Running 10s test @ http://localhost:8000
  8 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   610.83us  112.76us   3.91ms   66.68%
    Req/Sec     1.63k    40.42     1.75k    71.29%
  Latency Distribution
     50%  595.00us
     75%  690.00us
     90%  756.00us
     99%    0.91ms
  130973 requests in 10.10s, 46.89MB read
  Non-2xx or 3xx responses: 14616
Requests/sec:  12967.83
Transfer/sec:      4.64MB