benchmarks/results/nebulift-manual-instrument-rnd-1_8-c2.txt
Running 10s test @ http://localhost:8000
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   503.04us   99.80us   1.31ms   64.65%
    Req/Sec     1.96k   101.25     2.28k    66.34%
  Latency Distribution
     50%  532.00us
     75%  566.00us
     90%  601.00us
     99%  750.00us
  39333 requests in 10.10s, 13.53MB read
  Non-2xx or 3xx responses: 7752
Requests/sec:   3894.45
Transfer/sec:      1.34MB