benchmarks/results/nebulift-uninstrumented-rnd-1_0-c1.txt
Running 10s test @ http://localhost:8000
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     6.53ms    1.08ms   9.48ms   61.14%
    Req/Sec   152.89     18.47   191.00     64.00%
  Latency Distribution
     50%    6.57ms
     75%    7.32ms
     90%    7.82ms
     99%    8.85ms
  1526 requests in 10.02s, 591.62KB read
Requests/sec:    152.25
Transfer/sec:     59.03KB