benchmarks/results/nebulift-uninstrumented-rnd-1_0-c16.txt
Running 10s test @ http://localhost:8000
  8 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   714.04us  126.54us   5.31ms   87.79%
    Req/Sec     2.80k    52.75     2.90k    84.03%
  Latency Distribution
     50%  687.00us
     75%  733.00us
     90%  828.00us
     99%    1.18ms
  225081 requests in 10.10s, 85.00MB read
Requests/sec:  22284.98
Transfer/sec:      8.42MB